# GetAppearanceOverride Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MaterialNode..::..GetAppearanceOverride Method
MaterialNode Class See Also
---
Returns appearance properties that override the preset appearance of the material.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Asset GetAppearanceOverride()
```

Visual Basic
---
```text
Public Function GetAppearanceOverride As Asset
```

Visual C++
---
```text
public:
Asset^ GetAppearanceOverride()
```

# ### Return Value
An instance of a rendering material asset, of null if there is no override.
# Remarks
The returned instance of an Asset is valid only if there is an overide, which happens if there are decals applied to the face that has the base material. In such cases the rendering engine takes the asset of the material and merges it with the decal, which results to this override asset. If there are no decals, this instance is null and the HasOverriddenAppearance returns False.
# See Also
MaterialNode Class
Autodesk.Revit.DB Namespace